app/controllers/pages_controller.rb

SELECT "ideas".* FROM "ideas" ORDER BY favorites DESC LIMIT 24
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    if params[:tag]
      @ideas = Idea.tagged_with(params[:tag]).order('favorites').reverse
    else
      # @contents = Content.all
      @ideas = Idea.order('favorites').limit(24).reverse_order
    end

    @users = User.all

    @founder = User.where(:id => 15)