app/controllers/pages_controller.rb

  def index
    if params[:tag]
      @contents = Content.tagged_with(params[:tag]).order('favorites').reverse
    else
      # @contents = Content.all
      @contents = Content.order('favorites').limit(24).reverse_order
    end

    @users = User.all
---
SELECT "contents".* FROM "contents" JOIN taggings contents_taggings_e53d0b0 ON contents_taggings_e53d0b0.taggable_id = contents.id AND contents_taggings_e53d0b0.taggable_type = 'Content' AND contents_taggings_e53d0b0.tag_id = 19 ORDER BY favorites
SELECT "contents".* FROM "contents" ORDER BY favorites DESC LIMIT 24
SELECT "users".* FROM "users"