app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @user.views += 1
    @user.save
    @ideas = @user.ideas
    @favorites = []
    Favorite.where(:user_id => @user.id).each do |favorite|
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = 13