app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
---
  def update_views
    @user = User.find(params[:id])